Revit 2026 API

# SpacingRuleSetLayoutNone Method

---

Set the Layout property to None.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutNone()
```
```vb
Public Sub SetLayoutNone
```
```cpp
public:
void SetLayoutNone()
```
```fsharp
member SetLayoutNone : unit -> unit
```

No internal lines will be generated, but the effect is equivalent to having two lines, one at each end of the region.

#### Reference

SpacingRule Class

Autodesk.Revit.DB Namespace